[
  {
    "name": "Simona Aimar",
    "bio": "Simona Aimar is Vice Dean EDI and Assistant Professor of Philosophy at University College London. She works on ancient and contemporary theoretical philosophy, specializing in Aristotle, modality, and causation.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Aimar Simona.png",
    "originalName": "Aimar, Simona",
    "foundPhoto": true
  },
  {
    "name": "Shabnam Akhtari",
    "bio": "Shabnam Akhtari, Professor of Mathematics at Pennsylvania State University, specializes in Number Theory. She earned her undergraduate degree from Sharif University of Technology in Tehran and her Ph.D. from the University of British Columbia. Passionate about sharing the joy of mathematics, she enjoys inspiring others.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Akhatari Shabnam.png",
    "originalName": "Akhtari, Shabnam",
    "foundPhoto": true
  },
  {
    "name": "Patience Algokali",
    "bio": "Patience Wesoamo Alogokali is an experienced English Language educator with a Master of Philosophy in English Education. She is dedicated to supporting students from underserved communities, with a focus on inclusive, student-centered language instruction. Patience currently teaches Medical English and communication skills through NGOs such as Afghan Female Student Outreach (AFSO), Afghanistan Development Academy (ADA), and Paper Airplane—organizations committed to expanding global access to education. Her expertise lies in fostering oral language proficiency and grammatical competence. Her research interests include sociolinguistics, oral language instruction, teacher motivation, and effective teaching strategies. ",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Algokali patience.png",
    "originalName": "Algokali, Patience",
    "foundPhoto": true
  },
  {
    "name": "Naomi Altman",
    "bio": "Professor emerita of Statistics and Bioinformatics at The Pennsylvania State University, Naomi Altman specializes in applying mathematical sciences to fields like medical and biological sciences, earth and environmental sciences, and social sciences. Her expertise includes bioinformatics, high-dimensional data, model selection, and functional data analysis. She is also a member of the Huck Institutes of Life Sciences, focusing on bioinformatics and genomics.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Altman Naomi.png",
    "originalName": "Altman, Naomi",
    "foundPhoto": true
  },
  {
    "name": "Rahman Azari",
    "bio": "Rahman Azari is an associate professor of architecture and director of RE2 Lab at the Pennsylvania State University. Prior to Penn State, Professor Azari served as an assistant professor at the Illinois Institute of Technology and the University of Texas San Antonio. With a background in architecture, Azari holds a Ph.D. in Built Environment (Sustainability track) from the University of Washington in Seattle (2013). Azari is a Certified Passive House Consultant (CPHC).",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Azari Rahman  .png",
    "originalName": "Azari, Rahman",
    "foundPhoto": true
  },
  {
    "name": "Kathryn Batchelor",
    "bio": "Kathryn Batchelor is Professor of Translation Studies at UCL, specializing in translation theory, history, and literature. With her main working languages English, French, and German, she also contributes to the Comparative Literature program. She is the author of Decolonizing Translation (2009) and Translation and Paratexts (2018) and has co-edited six essay collections, including Translation Trouvailles (2023).",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Batchelor Kathryn.png",
    "originalName": "Batchelor, Kathryn",
    "foundPhoto": true
  },
  {
    "name": "Elena Berretta",
    "bio": "Elena Beretta is Clinical Professor of Mathematics at NYU Abu Dhabi and editor of the journal Inverse Problems. Her research focuses on mathematical modeling, partial differential equations, inverse problems, machine learning, medical imaging, and seismology. She has worked at leading research institutions worldwide and has been a plenary speaker at numerous international conferences.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Berretta, Elena .png",
    "originalName": "Berretta, Elena ",
    "foundPhoto": true
  },
  {
    "name": "Elisa Bertuzzo",
    "bio": "Elisa Bertuzzo is an ethnographer and urban sociologist with 20 years of experience in South Asia, focusing on care, community economies, and decolonial epistemologies. Her work uses participatory mapping, filming, and exhibiting to explore self-organization and innovation in marginalized urban areas. Professor Bertuzzo holds a PhD in Urban Studies from TU Berlin and has taught and conducted research at institutions like Free University Berlin, Humboldt University, and IIT Madras.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Bertuzzo, Elisa.png",
    "originalName": "Bertuzzo, Elisa",
    "foundPhoto": true
  },
  {
    "name": "Melissa Bloom",
    "bio": "Professor Melissa Bloom is an experienced ESL teacher dedicated to supporting diverse learners and refugees worldwide. She has taught English at all levels in the U.S. and abroad, including work in Lesvos, Greece, and currently teaches online through Refugee Education and Learning International. Melissa brings a strong background in creating dynamic, inclusive classrooms and a deep commitment to community outreach.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Bloom Melissa.png",
    "originalName": "Bloom, Melissa",
    "foundPhoto": true
  },
  {
    "name": "Finnan Carmel",
    "bio": "Professor Carmel Finnan, lectured in Language, Literature and Culture for seventeen years at Mary Immaculate College, University of Limerick, Ireland, in the Department of German Studies. In 2014 she set up her own business as a Communication Consultant for NGOs and small businesses and also teaches courses in Creative Writing. Currently she lives in Berlin, Germany. ",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Finnan Carmel .png",
    "originalName": "Finnan Carmel",
    "foundPhoto": true
  },
  {
    "name": "Colin Chamberlain",
    "bio": "Colin Chamberlain is Associate Professor of Philosophy at University College London, specializing in 17th and 18th century European philosophy with a focus on Descartes, Malebranche, Cavendish, and Astell.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Chamberlain Colin .png",
    "originalName": "Chamberlain, Colin",
    "foundPhoto": true
  },
  {
    "name": "Bill Chin",
    "bio": "Bill Chin is a Professor of Law at Lewis & Clark Law School teaching classes in legal analysis and writing, veterans' law, and law and culture. He has published law journal articles on various topics including education, immigration, culture, civil rights, and veterans. He also holds a master's in Political Science. During free time, he enjoys jogging and hiking.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Chin Bill .png",
    "originalName": "Chin, Bill",
    "foundPhoto": true
  },
  {
    "name": "Meisam Dadfarmay",
    "bio": "Professor Meisam Dadfarmay, Associate AIA, is an architectural designer and project manager with international experience spanning the U.S., Japan, and Iran. He has led projects ranging from small-scale to large-scale developments, blending technical expertise with innovative design solutions. Professor Dadfarmay completed his Master of Architecture at Penn State and is currently an instructor in the Department of Architecture at Penn State, where he teaches design studios.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Dadfarmay Meisam.png",
    "originalName": "Dadfarmay, Meisam",
    "foundPhoto": true
  },
  {
    "name": "Sarah Dzilinski",
    "bio": "Professor Sarah Dzilinski is an experienced educator with a Master’s in Teaching and over two decades of teaching, mentoring, and curriculum development in literacy and elementary education. She has taught at Fairfield University and the University of Phoenix, as well as in K–6 classrooms, specializing in literacy instruction and student support. Sarah is passionate about fostering engaging, inclusive learning environments and empowering students to thrive",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Dzilinski Sarah.png",
    "originalName": "Dzilinski, Sarah",
    "foundPhoto": true
  },
  {
    "name": "Esmé Ellis",
    "bio": "Esmé Ellis holds a B.A. from Bard College in Political Science and International Relations, as well as an M.A. in English Literature from Humboldt Universität zu Berlin in Germany. She is a speechwriter and executive communications strategist with 5+ years of experience working for international organizations, high-level diplomats, political candidates and parties, as well as other clients in the international field. She joined AFSO in Spring Semester 2025, and teaches a practical seminar course, Introduction to Political Speechwriting.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Ellis Esme.png",
    "originalName": "Ellis, Esmé",
    "foundPhoto": true
  },
  {
    "name": "Emanuela Evangelisti",
    "bio": "Professor Emanuela holds an MA in Cultural Studies from the University of Leeds, UK. She is currently Communications Manager at University College London (UCL) and provides mentorship to graduates of the Communication programme at the University of the Arts London (UAL). Additionally, Emanuela is a movement educator and an advocate for holistic learning, emphasizing the integration of science, art, and mind-body practices.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Evangelisti Emanuela .png",
    "originalName": "Evangelisti, Emanuela",
    "foundPhoto": true
  },
  {
    "name": "Angus Fake",
    "bio": "Angus Fake, a Newcastle native, studied Industrial Design at Pratt Institute before transitioning to education. He has taught art, design, psychology, and social studies at schools in Colorado and Maine. Currently, Professor Fake is part of Lincoln Academy's social studies department, teaching economics, government, and psychology. He enjoys Maine's outdoor activities in his free time.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Fake Angus .png",
    "originalName": "Fake, Angus",
    "foundPhoto": true
  },
  {
    "name": "Alex de Lusignan Fan-Moniz",
    "bio": "Alex Fan Moniz is a minority languages researcher at UCL, specializing in language revitalization. His work explores decolonial approaches, language teaching, music, digital media and storytelling as tools for sustaining minoritized languages. His publications include How to Kill a Language (2021) and Aromanian Vlach and Greek: Shifting Identities (2024), focusing on Galician and Aromanian language fragility.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Fan-Moniz Alex   .png",
    "originalName": "Fan-Moniz, Alex de Lusignan",
    "foundPhoto": true
  },
  {
    "name": "Arneodo Francesco",
    "bio": "\nFrancesco Arneodo is an experimental physicist interested in detectors for particle physics and their applications. He obtained his PhD from the University of Rome - La Sapienza. With an interest in the socio-economic aspects of science, he also obtained an MBA from the University of Warwick. He started his research activity at the Gran Sasso Laboratory, working on cosmic rays with the EAS-TOP experiment, then on neutrino physics with liquid argon detectors. Since 2004, he has been a part of the XENON program, an international collaboration that designed and operated several liquid xenon detectors for the search of Dark Matter. He joined NYUAD in 2013, creating a research group - The Astroparticle Laboratory - where he continues the effort on Dark Matter.\n",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Arneodo Francesco .png",
    "originalName": "Arneodo Francesco",
    "foundPhoto": true
  },
  {
    "name": "Elisa Francini",
    "bio": "Elisa Francini is Associate Professor of Mathematical Analysis at the University of Florence, Italy. With a PhD in Mathematics from the same university, her research explores inverse problems for partial differential equations. She also previously served as a researcher at the Italian National Research Council. Professor Francini is passionate about promoting diversity and inclusion in the field of mathematics.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Francini Elisa.png",
    "originalName": "Francini, Elisa",
    "foundPhoto": true
  },
  {
    "name": "Erin Leigh Frymire",
    "bio": "Erin Leigh Frymire is a lecturer at Trinity College, where she has taught since 2017. With a Ph.D. from Northeastern University and a B.A. from Skidmore College, her research focuses on systemic violence, rhetorics of the body, law, and human rights. She fosters a student-centered classroom, emphasizing critical thinking, rhetorical literacy, and effective communication skills.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Frymire, Erin Leigh.png",
    "originalName": "Frymire, Erin Leigh",
    "foundPhoto": true
  },
  {
    "name": "Felder Gary",
    "bio": "Professor of Physics at Smith College, Gary Felder researches matter production in the early universe and explores chaos theory's intersections with quantum mechanics. He has authored two textbooks—Mathematical Methods in Engineering and Physics and Modern Physics—and created the video course The Big Bang and Beyond for The Great Courses. He earned his PhD in Physics from Stanford University.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Felder Gary .jpg",
    "originalName": "Felder Gary ",
    "foundPhoto": true
  },
  {
    "name": "Briana Grenert",
    "bio": "Professor Briana Grenert is a PhD candidate in Religion at Duke University. Her research explores Christianity, angelology, and intercultural exchanges in late antiquity and the Middle Ages, and her dissertation covers the reception of Jezebel in Christian and Jewish literature. She has presents on Syriac and Byzantine literature, biblical reception, and religious iconography, and her work includes both scholarly publications and creative writing. With teaching and research experience across linguistic traditions and using digital humanities methodologies, she is committed to making ancient texts accessible to contemporary audiences.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Grenert Briana  .png",
    "originalName": "Grenert, Briana",
    "foundPhoto": true
  },
  {
    "name": "Gantt Gurley",
    "bio": "Professor David Gantt Gurley is Associate Professor of Scandinavian Studies at the University of Oregon and Faculty-in-Residence at the Clark Honors College. His research explores intersections of Scandinavian and Jewish literature, with publications on Meïr Aaron Goldschmidt, the Golem tradition, and modern Danish poetry. He is the author of Meïr Aaron Goldschmidt and the Poetics of Jewish Fiction (Syracuse University Press, 2016).",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Gurley Gantt.png",
    "originalName": "Gurley, Gantt",
    "foundPhoto": true
  },
  {
    "name": "Rana Habibi",
    "bio": "Professor Rana Habibi is a senior lecturer and researcher in urban design at the Faculty of Built Environment of the University of Breda and an associate researcher at the University of Leuven. Her courses include Urban Design Strategies, Design Labs in different contexts of China, South Africa, and the Netherlands, and Energy Transition: Future Urban Strategy at the University of Breda. Her research focuses on the intersection of non-western urban history, inclusive urbanism, and climate change. She is engaged in numerous European Union-funded projects such as Inclusive City, KreativEU, and Greengage within Breda University. Professor Habibi's monograph, \"Modern Middle-Class Housing in Tehran - A Reproduction of Archetype: Episodes of Urbanism 1945-1979\" (2021), stands out among her publications.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Habibi Rana .png",
    "originalName": "Habibi, Rana",
    "foundPhoto": true
  },
  {
    "name": "Emily Haynes",
    "bio": "Emily Haynes, PhD in Biophysics, has taught astronomy, chemistry, and physics at both high school and university levels, including Regis University in Denver. With experience as an analytical chemist and biotechnologist, she has also mentored students through NASA's Mars Exploration Rover and Phoenix lander programs. Many of her former students now thrive in careers across aerospace, medicine, and other scientific fields.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Haynes Emily.png",
    "originalName": "Haynes, Emily",
    "foundPhoto": true
  },
  {
    "name": "Simon Hewitt",
    "bio": "Simon Hewitt is Associate Professor of Theology at the University of Leeds, specializing in philosophy of religion, logic, and negative theology. His work bridges analytic philosophy and theology, and he has published widely on topics including divine mystery, Aquinas, and the philosophy of language. He also serves as Honorary Treasurer of the British Society for the Philosophy of Religion.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Hewitt Simon.png",
    "originalName": "Hewitt, Simon",
    "foundPhoto": true
  },
  {
    "name": "Janel Hill",
    "bio": "A graduate of UC Berkeley and the University of Arizona College of Law, Janel worked in employment discrimination and commercial litigation. She later volunteered at the College and Career Center at Sunset High School, now guiding students through the college application process. Janel loves board games, long walks, often with her dog Tofu, and harvesting and creating treats from her garden. ",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Hill Janel .png",
    "originalName": "Hill, Janel",
    "foundPhoto": true
  },
  {
    "name": "Jessie Barton Hronesova",
    "bio": "Professor Barton-Hronesova is a lecturer in political sociology at the School of Slavonic and East European Studies at University College London with a focus on Southeast and Central Europe. She has extensive experience and knowledge of comparative politics and the international development sector, both as an academic and practitioner. She works across several disciplines (political sociology, politics, history and socio-legal studies), using qualitative, archival and fieldwork methods. She holds a DPhil in Politics and MPhil in Russian and East European Studies, both from the University of Oxford.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Barton Hronesova Jessie  .png",
    "originalName": "Barton Hronesova, Jessie",
    "foundPhoto": true
  },
  {
    "name": "Shan Sherwan Hussain",
    "bio": "Shan Sherwan Hussain is currently a research fellow with the center for Public Leadership at the Harvard Kennedy School where she focuses on negotiation. She is a Gender Based Violence specialist and an experienced humanitarian leader, having first embarked on her professional journey by responding to support Syrian refugees and Iraqi IDPs during the war with ISIS. Later she worked in Ukraine and most recently in Jordan.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Hussein Shan Sherwan .png",
    "originalName": "Hussain, Shan Sherwan",
    "foundPhoto": true
  },
  {
    "name": "Dan Jetter",
    "bio": "Dan Jetter is the Founder/Director/Chem Phys Tutor for Education Equity Foundation, a nonprofit that provides free online preparation for the MCAT (Medical College Admissions Test) to low-income underrepresented premeds in the US. He has Master's Degrees in both Public Health and Science Teaching.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Jetter Dan .png",
    "originalName": "Jetter, Dan",
    "foundPhoto": true
  },
  {
    "name": "Lewis Judy",
    "bio": "Professor Judy Lewis is a public health sociologist and Professor Emeritus of Public Health Sciences and Pediatrics at the University of Connecticut Medical School.  Her major interests are women's health, maternal, child and adolescent health, and health care in low resource countries. She is President of the Grand'Anse Health & Development Association Board and founding member and Board Chair of Women and Health Together for the Future. Her global health leadership has included the World Federation of Public Health Associations, American Public Health Association and CORE Group. She received the 2018 Carl E. Taylor Lifetime Achievement Award from the International Health Section, American Public Health Association, honoring the visionaries and leaders in international health.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Lewis Judy .png",
    "originalName": "Lewis Judy ",
    "foundPhoto": true
  },
  {
    "name": "Barbara Kaltenbacher",
    "bio": "Barbara Kaltenbacher is Professor of Applied Analysis at the University of Klagenfurt, Austria, specializing in inverse problems, regularization, and PDE-constrained optimization. She is a member of the European Mathematical Society Executive Committee and holds a doctorate from Johannes Kepler University, Linz.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Kaltenbacher Barbara .png",
    "originalName": "Kaltenbacher, Barbara",
    "foundPhoto": true
  },
  {
    "name": "Ellen W Kaplan",
    "bio": "Ellen W. Kaplan, Professor emerita of Acting and Directing at Smith, is a Fulbright Scholar, actress, director, and playwright with global teaching and performance experience. She has worked in countries including Pakistan, China, Israel, and Romania, and taught at institutions like Tel Aviv University and the University of Kurdistan. During the pandemic, she taught virtually at Rojava University in Syria.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Kaplan Ellen W. .jpg",
    "originalName": "Kaplan, Ellen W",
    "foundPhoto": true
  },
  {
    "name": "Jennifer Katcher",
    "bio": "Professor Jennifer Katcher is Instructional Faculty in Biology at Pima Community College, where she has taught since 1997. She specializes in developing course-based undergraduate research experiences (CUREs) and innovative laboratory curricula that strengthen student engagement and scientific skills. Her recent publications focus on expanding research opportunities in community college and Hispanic-serving Institution settings.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Katcher Jennifer .png",
    "originalName": "Katcher, Jennifer",
    "foundPhoto": true
  },
  {
    "name": "Leslie King",
    "bio": "Leslie King's research and teaching focus on population studies, environmental sociology, social movements, and corporate power. Her work explores how ideologies—such as nationalism, gender, race, and class—shape population policies. More recently, she has examined corporate influence on activism and environmental sustainability. She teaches courses on corporate power, food sociology, and population politics. Her research is published in journals including Critical Sociology, Social Movement Studies, and Mobilization, and she is co-editor of the anthology Environmental Sociology: From Analysis to Action.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/King Leslie .png",
    "originalName": "King, Leslie",
    "foundPhoto": true
  },
  {
    "name": "Christoph König",
    "bio": "Christoph König is a doctoral candidate at Humboldt-Universität Berlin and teaches private and corporate law at the University of Erfurt. A former chairman of the Refugee Law Clinic Berlin and the Refugee Law Clinics Germany, he works on legal theory, comparative law, legal history, and civil liberties.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/König Christoph .jpg",
    "originalName": "König, Christoph",
    "foundPhoto": true
  },
  {
    "name": "Anjali Kuthoore",
    "bio": "Professor Anjali Kuthoore is a biology professor passionate about inclusive, learner-centered teaching. She has a passion for general biology and human physiology. She emphasizes equity, curiosity, mentorship, and connection, fostering an environment where students feel valued, inspired, and empowered to grow as critical thinkers, collaborators, and engaged citizens.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Kuthoore Anjali.png",
    "originalName": "Kuthoore, Anjali",
    "foundPhoto": true
  },
  {
    "name": "Anne Lavergne",
    "bio": "Anne Lavergne is Senior Lecturer at Simon Fraser University's School of Computing Science in Canada. She enjoys introducing students to the world of Computing Science both at SFU and globally in countries like China, Uruguay, and Malawi. When not teaching, Professor Lavergne enjoys traveling and trekking adventures around the world.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Lavergne Anne .jpg",
    "originalName": "Lavergne, Anne ",
    "foundPhoto": true
  },
  {
    "name": "Rachel Leff",
    "bio": "Rachel Leff is a librarian who serves as the Head of Research Services at the Sarah Lawrence College Library. In addition to working with students, she teaches about research, academic libraries, and information literacy. Rachel is very interested in the history of libraries and in information ecosystems. When she's not working, she loves spending time with her husband and daughter, who recently talked her into keeping honeybees!",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Leff Rachel .jpg",
    "originalName": "Leff, Rachel",
    "foundPhoto": true
  },
  {
    "name": "Philip Letts",
    "bio": "Professor Philip Letts is a Lecturer in Philosophy at the University of Birmingham whose research focuses on metaphysics, aesthetics, and the philosophy of art. He has published widely on the ontology of musical works, including award-winning work on the property theory of music, and continues to explore intersections between metaphysics, logic, and aesthetics. His teaching spans logic, ethics, social justice, and 20th-century analytic philosophy.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Letts Philip.png",
    "originalName": "Letts, Philip",
    "foundPhoto": true
  },
  {
    "name": "Deanne Loonin",
    "bio": "Deanne Loonin is a retired legal aid lawyer based in Northampton, Massachusetts. She spent her career advocating for student borrowers, especially those harmed by predatory lending. Deanne founded the Student Loan Borrower Assistance Project at the National Consumer Law Center and concluded her work at the Project on Predatory Student Lending. She has authored numerous publications and reports. Deanne holds a B.A. from Harvard-Radcliffe and a J.D. from UC Berkeley. A lifelong athlete and former competitive tennis player, she champions the role of women's sports in advancing empowerment and equality.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Loonin Deanne .png",
    "originalName": "Loonin, Deanne",
    "foundPhoto": true
  },
  {
    "name": "Ferriss Lucy",
    "bio": "Professor Lucy Ferriss is President of the Board of Afghan Female Student Outreach and Writer in Residence Emerita at Trinity College. Recipient of awards from the National Endowment for the Arts, The Faulkner Society, and others, she is the author of twelve books, mostly fiction. Recent work includes her memoir of reading, The Man Who Loved Children; her essay collection, Meditations for a New Century (2023); her republished novel The Misconceiver (2022); Foreign Climes: Stories (2021); and the novel A Sister to Honor (2015). She lives in Connecticut and the Berkshires of western Massachusetts.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Ferris Lucy.png",
    "originalName": "Ferriss Lucy ",
    "foundPhoto": true
  },
  {
    "name": "Ina Malloy",
    "bio": "Ina Malloy has 40 years of experience teaching art, with a focus on photography and digital art for 25 years. She has mentored over 2,500 students, many of whom have built successful careers in photography, design, or media. She led the Amity Teen Teaching Program, placing 500+ students in elementary schools and donating 18,000 books to young learners. Many of her former students now work as educators themselves.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Malloy Ina .jpg",
    "originalName": "Malloy, Ina",
    "foundPhoto": true
  },
  {
    "name": "Sean McCann",
    "bio": "Sean McCann is the William R. Kenan, Jr. Professor of the Humanities at Wesleyan University, where he has taught courses in English and American literature for three decades. He is the author of Gumshoe America: Hardboiled Crime Fiction and The Rise and Fall of New Deal Liberalism (Duke University Press, 2000); A Pinnacle of Feeling: American Literature and Presidential Government (Princeton University Press, 2008); and multiple articles and essays.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/McCann Sean .png",
    "originalName": "McCann, Sean ",
    "foundPhoto": true
  },
  {
    "name": "Jillian Miller",
    "bio": "Jillian Miller is an English language educator with over a decade of experience teaching adult immigrants and refugees in the United States. She also serves as Assistant Director of a refugee resettlement agency in Western Massachusetts, where she oversees Employment, ESOL, and Community Education programs. She is also a certified yoga, Pilates, and meditation instruction, and loves both practicing and teaching in her free time.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Miller Jillian .png",
    "originalName": "Miller, Jillian",
    "foundPhoto": true
  },
  {
    "name": "Anna Mondino",
    "bio": "Anna Mondino is the Head of a Research Unit at the San Raffaele Scientific Institute, in Milan, Italy. Her research focuses on the characterization of immune response to cancer and ways to ameliorate it. Her group is interested in exploiting T lymphocyte as living drugs, and in genetic engineering for redirecting patients T cells against their own disease. Her work has been published internationally, and she has received research grants. She teaches as adjunct professor within university courses and participates to outreach activities to communicate science outside research labs. She holds a PhD in Molecular Oncology from the University of Torino and has spent several years in New York and Minneapolis. ",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Mondino Anna  .png",
    "originalName": "Mondino, Anna",
    "foundPhoto": true
  },
  {
    "name": "Don Moon",
    "bio": "Professor Donald Moon is the Ezra and Cecile Zilkha Professor emeritus in the College of Social Studies, Wesleyan University. He is the author of John Rawls: Liberalism and the Challenges of Late Modernity and Constructing Community: Moral Pluralism and Tragic Conflicts. He has published widely and served on numerous boards, including the American Political Science Association. He earned his PhD at the University of Minnesota.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Moon Don .png",
    "originalName": "Moon, Don ",
    "foundPhoto": true
  },
  {
    "name": "Janet F Morrison",
    "bio": "Janet Morrison has been teaching in Trinity College's Chemistry Department since 1997, covering courses in Analytical Chemistry, Forensic Science, and more. Her research centers on developing and optimizing methods to detect trace analytes in biological specimens, including drugs, Parkinson's biomarkers, and ethanol indicators. She holds degrees from Hartwick College, Northeastern University, and The American University.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Morrison Janet F .jpg",
    "originalName": "Morrison, Janet F",
    "foundPhoto": true
  },
  {
    "name": "Julie Mughal",
    "bio": "Julie Mughal is the convenor of the Jesuit Universities Humanitarian Action Network (JUHAN) and the Director of the Humanitarian Action Minor in the Center for Social Impact at Fairfield University. Prior to Fairfield, she worked at the International Organization for Migration (IOM) in Geneva and Save the Children in the U.S. and Pakistan. She is the author of Land Without Hats, a book that explores the difficulties faced by widows in the developing world and their courage in the face of adversity. She holds an M.A. from the Maxwell School of Citizenship and Public Affairs at Syracuse University.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Mughal Julie .png",
    "originalName": "Mughal, Julie",
    "foundPhoto": true
  },
  {
    "name": "Jessie Munton",
    "bio": "Professor Jessie Munton is Associate Professor of Philosophy at the University of Cambridge and a Fellow of St John’s College. Her research spans epistemology, philosophy of mind, and perception, with a particular focus on salience, attention, and prejudice. She is the author of the forthcoming book Priority and Prejudice: The Epistemology of Salience and Attention (Oxford University Press) and winner of the Sanders Prize in Philosophy of Mind and a 2023 Peter Leverhulme Prize.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Munton Jessie.png",
    "originalName": "Munton, Jessie",
    "foundPhoto": true
  },
  {
    "name": "Steve O'Brien",
    "bio": "Steve O'Brien is a retired PhD chemist who spent much of his career in the chemical industry, rising from scientist to chemical plant manager. A highlight of his work was co-developing a fuel additive that extended oil life and improved fuel efficiency—before the era of electric vehicles. Now an advocate for clean energy, he drives an electric car powered by solar panels. Alongside his industry career, Steve taught chemistry part-time and later transitioned to full-time teaching in math, chemistry, and environmental science. At Westfield State University, he embraced online education, offering recorded lectures, slides, and responsive support to enhance student learning.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/O_Brien Steve .png",
    "originalName": "O'Brien, Steve",
    "foundPhoto": true
  },
  {
    "name": "Patricia Bernadette O’Hara",
    "bio": "Professor Patricia Bernadette O’Hara is the Amanda and Lisa Cross Professor of Chemistry, emerita, at Amherst College, where she taught and mentored students for over four decades. An accomplished biophysical chemist and award-winning educator, she has published widely on protein dynamics, molecular gastronomy, and the chemistry of olive oil. She continues to share her expertise internationally through teaching, research collaborations, and public engagement in science and education.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/O_Hara Patricia Bernadette .png",
    "originalName": "O’Hara, Patricia Bernadette ",
    "foundPhoto": true
  },
  {
    "name": "Natalia V Parker",
    "bio": "Professor Natalia Parker is a lecturer in the School of Slavonic and East European Studies at University College London. As well as being a keen educator and a language practitioner, she researches how learners process language information and looks for ways of optimizing learners' cognitive processing in the classroom. She earned her MA in Applied Linguistics at the University of Sheffield, and her PhD at the University of Leeds.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Parker Natalia .png",
    "originalName": "Parker, Natalia V",
    "foundPhoto": true
  },
  {
    "name": "Reut Yael Paz",
    "bio": "An expert in public international law, European law, and international legal history, Professor Paz holds degrees in law and political science from the University of Helsinki and a Ph.D. from Bar-Ilan University. She is a senior researcher at the Franz von Liszt Institut für Internationales Recht at Justus Liebig Universität Gießen and is the author of A Gateway Between a Distant God & a Cruel World (2012).",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Paz Reut Yael .png",
    "originalName": "Paz, Reut Yael",
    "foundPhoto": true
  },
  {
    "name": "Elaine Pimentel",
    "bio": "Professor Elaine Pimentel is Associate Professor of Logic and Computation at University College London, specializing in logic, proof theory, and their applications to computational systems. She has published extensively on linear and modal logics, automated reasoning, and proof systems, and is actively involved in international research collaborations and conference leadership. Beyond research, she leads outreach initiatives promoting diversity and gender equality in STEM.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Pimentel  Elaine .png",
    "originalName": "Pimentel, Elaine",
    "foundPhoto": true
  },
  {
    "name": "Xavier Prudent",
    "bio": "Xavier Prudent, a physicist and engineer, holds degrees in physics from Grenoble Engineering School, a master's in particle physics from Joseph Fourier University, and a PhD from Stanford University, where he worked on the BaBar experiment. He has conducted research for the ATLAS experiment at the Large Hadron Collider and specialized in bio-statistics at the Max Planck Institute. Currently, he serves as Director of Technology at Civilia, enhancing public transportation infrastructure in Canada.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Prudent Xavier .png",
    "originalName": "Prudent, Xavier",
    "foundPhoto": true
  },
  {
    "name": "Sue Quinlan",
    "bio": "Professor Sue Wallington Quinlan, Ph.D. is a clinical psychologist who specialized in diagnostic assessment and educational consultation throughout a distinguished career spanning five decades. A Yale-trained psychologist, she maintained a private practice while serving as adjunct clinical faculty at Yale School of Medicine and consulting for numerous independent schools. Now retired, she remains recognized for her contributions to psychological assessment, education, and child development.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Quinlan Sue.png",
    "originalName": "Quinlan, Sue",
    "foundPhoto": true
  },
  {
    "name": "Sarah Rajtmajer",
    "bio": "Sarah Rajtmajer is Assistant Professor at Penn State's College of Information Sciences and Technology and a research associate with the Rock Ethics Institute. Her work combines AI, machine learning, and human-AI systems to explore values like accuracy, objectivity, and privacy in managing information ecosystems. She holds a PhD in mathematics from the University of Zagreb and a BA in mathematics from Columbia University.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Rajtmajer Sarah .jpg",
    "originalName": "Rajtmajer, Sarah",
    "foundPhoto": true
  },
  {
    "name": "Gabriella Reyes",
    "bio": "Professor Gabriella P. Reyes is a researcher, librarian, and educator who has held roles in the U.S., Europe, Asia, and the Middle East. Currently pursuing a PhD at the UCL Institute of Education, she centers her work on decolonial approaches to education and library practice. Gaby holds a BA from Brown University and an MA in Library and Information Studies from UCL.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Reyes Gabriella.png",
    "originalName": "Reyes, Gabriella",
    "foundPhoto": true
  },
  {
    "name": "Anna Rubartelli",
    "bio": "Anna Rubartelli is an MD with a Master in Hematology. She led the Cell Biology Unit at the National Cancer Center, San Martino Hospital, of Genoa (Italy), until 2018. Dr. Rubartelli is a leading scientist in the area of innate immunity and inflammation. Her studies led to elucidate the role of the cytokine IL-1beta in inflammation and in inflammation-related diseases. She also contributed highlight the therapeutic effects of anti-IL-1beta biologic drugs in different diseases. Since her retirement, she teaches at University courses and participates to outreach activities to communicate science outside research labs.  Anna has published 135 highly cited original research articles and reviews, and 4 scientific books and presented her work at international meetings. ",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Rubartelli  Anna .png",
    "originalName": "Rubartelli, Anna ",
    "foundPhoto": true
  },
  {
    "name": "Shazia Sadaf",
    "bio": "Shazia Sadaf\nShazia Sadaf teaches Human Rights and Social Justice in the Institute of Interdisciplinary Studies at Carleton University in Canada. She holds a PhD in English Language and Literature from the University of London and a second doctoral degree in Postcolonial Studies from Western University, Canada, with a primary interest in the field of human rights literature.\nProfessor Sadaf's research focus lies in the intersectional areas of War on Terror studies, human rights discourse, and post-9/11 Anglophone literature. Professor Sadaf is currently working on a research monograph on contemporary Pakistani speculative fiction with Aroosa Kanwal. She is also an Associate Editor for the Journal of Postcolonial Writing.\n",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Sadaf Shazia .png",
    "originalName": "Sadaf, Shazia ",
    "foundPhoto": true
  },
  {
    "name": "Carolina Santos",
    "bio": "Carolina Santos is an M.D. specializing in infectious diseases and a dedicated researcher in maternal and child health, cultural competency, and environmental health. With a Ph.D. in child and adolescent health and a master's in health professional education, she is the founder of \"A Arte de Nascer,\" a nonprofit improving the well-being of pregnant women and children in northeastern Brazil.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Santos Carolina .png",
    "originalName": "Santos, Carolina",
    "foundPhoto": true
  },
  {
    "name": "Rachel Schwartz",
    "bio": "Dr. Rachel Schwartz is an associate professor in the Department of Biological Sciences at the University of Rhode Island. Her research uses computational approaches to analyze the genetic data used to understand how species are related. She has taught multiple courses in computational methods for research, and genetics. ",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Schwartz Rachel  .png",
    "originalName": "Schwartz , Rachel",
    "foundPhoto": true
  },
  {
    "name": "Tasia Scrutton",
    "bio": "Professor Anastasia (Tasia) Scrutton is Associate Professor of Philosophy and Religion at the University of Leeds, specializing in philosophy of religion, theology, and the intersections of religion, psychiatry, and mental health. Her research explores how religious experience and interpretation shape understandings of depression, grief, and spiritual well-being, with publications including Christianity and Depression and Thinking through Feeling. She is also active in public engagement, bringing philosophical and theological perspectives on mental health to wider audiences through talks, podcasts, and writing.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Scrutton Tasia.png",
    "originalName": "Scrutton, Tasia",
    "foundPhoto": true
  },
  {
    "name": "Shiva Shakhesi",
    "bio": "Professor Shiva Shakhesi is an education and refugee advocacy professional with extensive international experience supporting displaced and vulnerable communities. She has led inclusion and learning support programs across schools in Kosovo, Fiji, India, and Australia, with a focus on refugee integration, trauma-informed practices, and equitable access to education. Fluent in Farsi, English, and Dari, Shiva is pursuing an Ed.D. in Curriculum and Instruction with research centered on the educational experiences of Afghan refugee students.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Shakhesi Shiva.png",
    "originalName": "Shakhesi, Shiva",
    "foundPhoto": true
  },
  {
    "name": "Kirstin Smith",
    "bio": "Professor Kirstin Smith explores how performance influences daily life, shaping concepts of value, identity, and economy. She teaches performance theory, texts, practice, and writing, and enjoys supervising creative dissertations. Her recent research focuses on casting, and her book on the emergence of stunts in public life is published by Routledge. Starting as an actor on screen and stage, Kirstin later became a dramaturg and devising performer. She has also published fiction and worked in disability access, embracing an eclectic approach to her work.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Smith Kirstin  .png",
    "originalName": "Smith, Kirstin",
    "foundPhoto": true
  },
  {
    "name": "Huber Sonya",
    "bio": "Sonya Huber is Professor of English at Fairfield University in Connecticut. A writer of creative nonfiction and journalism, she has published five books including Opa Nobody, Cover Me: A Health Insurance Memoir, and Pain Woman Takes Your Keys and Other Essays from a Nervous System. She specializes in social justice and nonfiction writing, writing pedagogy, immersion writing, the history of the essay, and issues of chronic pain.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Huber Sonya  .png",
    "originalName": "Huber Sonya ",
    "foundPhoto": true
  },
  {
    "name": "Johanna Stiebert",
    "bio": "Professor Johanna Stiebert, Ph.D. is Professor of Hebrew Bible at the University of Leeds and Director of the Centre for Religion and Public Life. Her research explores the Hebrew Bible in relation to gender, sexuality, violence, and contemporary social issues, with recent publications including Rape Myths, The Bible and #MeToo and Sacred Queer Stories. She has also co-led collaborative projects with African scholars and LGBTQ+ refugee communities, bringing academic work into dialogue with lived experience.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Stiebert Johanna.png",
    "originalName": "Stiebert, Johanna",
    "foundPhoto": true
  },
  {
    "name": "Scott Sturgeon",
    "bio": "Professor Scott Sturgeon is Professor of Philosophy at the University of Birmingham and President of the Aristotelian Society (2023–24). He has held distinguished visiting positions at Brown, Michigan, and Harvard, and previously taught at Oxford, Birkbeck, and King’s College London. His research spans epistemology, metaphysics, and philosophy of mind, with influential books and articles on rationality, consciousness, and belief.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Sturgeon Scott.png",
    "originalName": "Sturgeon, Scott",
    "foundPhoto": true
  },
  {
    "name": "Dianna Taylor",
    "bio": "Dianna Taylor is Professor of Philosophy and Director of the Gender, Sexuality, and Women's Studies Program at John Carroll University in Cleveland, Ohio, USA. She is author of Sexual Violence and Humiliation: A Foucauldian-Feminist Perspective (Routledge, 2020) editor of Michel Foucault: Key Concepts (Acumen, 2010), and co-editor of Feminist Politics: Identity, Difference, Agency (Rowman and Littlefield, 2007) and Feminism and the Final Foucault (University of Illinois, 2004). Her current research identifies and analyzes feminist resources for preventing and resisting sexual violence and the sexual humiliation it produces.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Taylor Dianna .jpg",
    "originalName": "Taylor, Dianna",
    "foundPhoto": true
  },
  {
    "name": "Temenuga Trifonova",
    "bio": "Temenuga Trifonova is Associate Professor of Creative Arts and Humanities: Moving Image at UCL. Her prolific works include Precarity in Western European Cinema (2025), Screening the Art World (2022), and The Figure of the Migrant in Contemporary European Cinema (2020). She explores European cinema, visual culture, and the intersection of film, philosophy, and psychopathology. She has also authored two novels, Tourist (2018) and Rewrite (2014).",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Trifonova Temenuga .jpg",
    "originalName": "Trifonova, Temenuga",
    "foundPhoto": true
  },
  {
    "name": "Persheng Vaziri",
    "bio": "Persheng Vaziri is Special Assistant Professor in Film Studies at Hofstra University, specializing in film history and world cinema. Her book Non-fiction in Iran: Filming Social Change is forthcoming from the University of Texas Press.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Vaziri Persheng .jpg",
    "originalName": "Vaziri, Persheng ",
    "foundPhoto": true
  },
  {
    "name": "Vishnu Vinekar",
    "bio": "Professor Dr. Vishnu Vinekar is an Associate Professor of Analytics at Fairfield University’s Charles F. Dolan School of Business. His research explores the business value of information technology, knowledge management, and data-driven innovation, with publications in leading journals and international conferences. He is also deeply engaged in service-learning initiatives, partnering with global and local organizations to apply analytics and technology toward community impact.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Vinekar Vishnu.png",
    "originalName": "Vinekar, Vishnu",
    "foundPhoto": true
  },
  {
    "name": "Maggie Whitehead",
    "bio": "Professor Margaret (Maggie) Whitehead is a writer and educator whose work spans nonfiction, journalism, and narrative storytelling. Her essays and reportage have appeared in publications such as The Missouri Review, The Atavist Magazine, and North American Review, earning recognition from The Best American Essays and a nomination by her editor at The Atavist for a National Magazine Award. She teaches creative writing and literature, most recently at Smith College's Precollege Creative Writing Workshop, and is represented by Sterling Lord Literistic in New York.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Whitehead  Margaret (Maggie) .png",
    "originalName": "Whitehead, Maggie",
    "foundPhoto": true
  },
  {
    "name": "Jennifer Wilz",
    "bio": "Professor Jennifer Wilz is a historian of Germany and Modern Europe who has taught at Beloit College, Rock Valley College, and Humboldt University in Berlin. She holds a PhD in European History from Brown University, where she specialized in modern Germany, Britain, and urban history. Alongside her academic work, she and her husband run a tutoring and test prep center in the Chicago area, where she draws on more than two decades of teaching experience in history, writing, languages, and standardized test preparation. They live in Illinois with their high school-aged son and one cat.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Wilz Jennifer.png",
    "originalName": "Wilz, Jennifer",
    "foundPhoto": true
  },
  {
    "name": "Captain (Retired) Cheng Xu",
    "bio": "Captain (Retired) Cheng Xu, Assistant Professor of Government at Smith College, specializes in qualitative research methods, international relations, conflict studies, and Southeast Asian politics. With a Ph.D. in political science from the University of Toronto, his research focuses on insurgency, civil war, and mass violence in Southeast Asia, using the Philippines as a case study to examine civilian interactions with armed groups.",
    "image": "/assets/AFSO Web Assets/AFSO A to Z Professor Photos/Xu Cheng Captain (Retired)  .jpg",
    "originalName": "Xu, Captain (Retired) Cheng ",
    "foundPhoto": true
  }
]